Repository: Etiennef/mnotification
Catalog: locales/*.po
Languages: fr_fr

# event.change_due_date
source: Due date change
fr_fr: Changement de la date d'échéance

# config.filtered_target.title
source: Configuration for 'filtered' notification targets
fr_fr: Configuration des cibles de notification 'filtrées'

# config.filtered_target.active
source: Activate 'filtered' notificaiton targets
fr_fr: Activer les cibles de notifications filtrées

# config.filtered_target.active.tootlip
source: Activate this option to get access to new notification targets usable in notification configuration if you need more subtle groups than what you get with raw GLPI. Main objective is to allow sending different notificaiton to people having different rôles on a ticket, and that even if they have several rôles on the same ticket. If you want to unactivate this, or uninstall the plugin, you should reconfigure your notifications before.
fr_fr: Activer cette option donne accès à des nouvelles cibles de notification pouvant être utilisées dans le paramétrage des notifications si on souhaite plus de finesse qu'avec GLPI brut. L'objectif primaire est de permettre de mieux adapter les notifications envoyées en fonction du (des) rôle(s) joué(s) sur le ticket. Attention, si on désactive cette option, il faut changer le réglage des notifications afin de ne plus les faire utiliser ces groupes (en fait, il vaut même mieux re-paramétrer les notifications AVANT de désactiver cette fonctionnalité)

# targets.filtered_user_requester
source: Filtered named requesters
fr_fr: Demandeurs nominatifs filtrés

# config.filtered_target.not_user_observer
source: Remove named observers
fr_fr: Retirer les personnes placées en observateur

# config.filtered_target.not_group_observers
source: Remove people in observer groups
fr_fr: Retirer les membres de groupes placés en observateurs

# config.filtered_target.not_user_technician
source: Remove named assigned technicians
fr_fr: Retirer les techniciens auxquels le ticket est nominativement attribué

# config.filtered_target.not_group_technicians
source: Remove people in assigned groups
fr_fr: Retirer les membres de groupes auxquels le ticket est attribué

# targets.filtered_group_requesters
source: Filtered requester groups
fr_fr: Groupes utilisateurs filtrés

# targets.filtered_user_observer
source: Filtered named observers
fr_fr: Observateurs nominatifs filtrés

# config.filtered_target.not_user_requester
source: Remove named requesters
fr_fr: Retirer les demandeurs

# config.filtered_target.not_group_requesters
source: Remove people in requester groups
fr_fr: Retirer les membres des groupes demandeurs

# targets.filtered_group_observers
source: Filtered observer groups
fr_fr: Groupe observateurs filtrés

# targets.filtered_user_technician
source: Filtered assigned technicians
fr_fr: Attribués à filtrés

# targets.filtered_group_technicians
source: Filtered assigned groups
fr_fr: Groupes attribués à filtrés

# targets.filtered_group_techifnotech
source: Filtered assigned groups if no named assigned technician
fr_fr: Groupes attribués à si non pris en charge nominativement filtrés

# config.change_duedate.title
source: Configuration for due date change notificaiton
fr_fr: Notification sur la date d'échéance

# config.change_duedate.active
source: Activate notification
fr_fr: Activer la notification sur la date d'échéance

# config.change_duedate.active.tootlip
source: Activating this notification add an event on which you can plug a cumston notification. It sort of is a sub-event from the ticket update event, and is therefore usefull if you want a notification on deu date change, but not on every update. This also adds three notification datas : ##mnotification.subevent## (set, remove or change), ##mnotification.prev_duedate## and ##mnotification.new_duedate##.
fr_fr: En activant cette option, vous ajoutez un évènement de notification. Il s'agit d'un 'sous-évènement' de l'évènement de mise à jour du ticket (il est donc utile si vous ne voulez pas notifier toutes les mises à jours, mais seulement le changement de la date d'échéance). Activer cette notification ajoute trois champs accessible depuis les modèles de notifications : ##mnotification.subevent## (set, remove ou change), ##mnotification.prev_duedate## et ##mnotification.new_duedate##.

# config.change_duedate.mindiff
source: Minimal due date change to trigger a notification
fr_fr: Délai minimal de changement pour déclencher une notification

# config.change_duedate.mindiff.tootlip
source: Changes lower than this value (in seconds) will not trigger a notification. It is highly recommanded to set this at 60 or more, as the way the ticket update form works will make false positive otherwise. Anyway, who changes due date for less than a minute?
fr_fr: Les changements de date d'échéance inférieurs à ce délai (en secondes) ne déclencheront pas de notifications. Il est vivement recommandé de choisir un délai d'au moins une minute (la façon dont le formulaire d'édition de tickets gère les secondes est étrange, ça fait plein de faux positifs). De toute façon, qui modifie une date d'échéance pour moins d'une minute?

# config.change_duedate.dateformat
source: Format used for date in notificaiton
fr_fr: Format de la date dans les notifications

# config.change_duedate.format.tootlip
source: Due date in plugin specific fields will be formated with this value. Must be a valid php Date->format string ('Y-m-d h:i:s' for example). Goal is to avoid to notify a very precise date when due date is mabye just intended to be a day.
fr_fr: Le format dans lequel sera mis la date d'échéance dans les champs spécifiques au plugin. Ce doit être un format valide pour Date.format en php ('Y-m-d h:i:s' par exemple). Utile si les dates d'échéances sont fixées au jour prêt.

# targets.group_techifnotech
source: Assigned groups if no named assigned technician
fr_fr: Groupes attribués à si non pris en charge nominativement

# setup.wrongversion
source: This plugin is only compatible with GLPI 0.84
fr_fr: Ce plugin n'est compatible qu'avec la version 0.84 de GLPI

# setup.require.configmanager
source: This plugin requires Configmanager 1.x.x
fr_fr: Ce plugin requiert Configmanager en version 1.x.x pour fonctionner.
